In [191]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
school_data_to_load = "schools_complete.csv"
student_data_to_load = "students_complete.csv"

# Read School and Student Data File and store into Pandas Data Frames
school_data = pd.read_csv(school_data_to_load)
student_data = pd.read_csv(student_data_to_load)

# Combine the data into a single dataset
school_data_complete = pd.merge(student_data, school_data, how="left", on=["school_name", "school_name"])

In [192]:
school_data_complete.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [193]:
total_schools = len(school_data_complete['school_name'].unique())
total_schools

15

In [194]:
total_students = len(school_data_complete['student_name'])
total_students

39170

In [195]:
budgets = school_data_complete["budget"].unique()
budgets

array([1910635, 1884411, 1056600, 3022020,  917500, 1319574, 1081356,
       3124928,  248087,  585858, 1049400, 2547363, 3094650, 1763916,
       1043130], dtype=int64)

In [196]:
budgets_df = pd.DataFrame(budgets)
budgets_df.head()

         0
0  1910635
1  1884411
2  1056600
3  3022020
4   917500

In [197]:
#budgets_df = budgets_df.rename(
#    columns={0: "Budget"})
#budgets_df.head()

In [198]:
total_budget = budgets_df.sum()
total_budget

0    24649428
dtype: int64

In [199]:
average_math = school_data_complete['math_score'].mean()
average_math

78.98537145774827

In [200]:
average_reading = school_data_complete['reading_score'].mean()
average_reading

81.87784018381414

In [201]:
overall_passing = ((average_math + average_reading)/2)
overall_passing

80.43160582078121

In [202]:
passing_math_df = school_data_complete.loc[school_data_complete['math_score'] >= 70, :]
# passing_math_df.head()

In [203]:
percent_passing_math = (len(passing_math_df['student_name'])/total_students)*100
percent_passing_math

74.9808526933878

In [204]:
passing_reading_df = school_data_complete.loc[school_data_complete['reading_score'] >= 70, :]
# passing_reading_df.head()

In [205]:
percent_passing_reading = (len(passing_reading_df['student_name'])/total_students)*100
percent_passing_reading

85.80546336482001

In [206]:
# Create a dataframe to hold the above results
results_district_df = pd.DataFrame({"Total Schools" : total_schools,
                                    "Total Students": total_students,
                                    "Total Budget": total_budget,
                                    "Average Math Score": average_math,
                                    "Average Reading Score": average_reading,
                                    "% Passing Math": percent_passing_math,
                                    "% Passing Reading": percent_passing_reading,
                                    "% Overall Passing Rate": overall_passing
                                   })
results_district_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate
0,15,39170,24649428,78.985371,81.87784,74.980853,85.805463,80.431606

In [207]:
results_district_df.dtypes

Total Schools               int64
Total Students              int64
Total Budget                int64
Average Math Score        float64
Average Reading Score     float64
% Passing Math            float64
% Passing Reading         float64
% Overall Passing Rate    float64
dtype: object

In [208]:
results_district_df["Total Students"] = pd.to_numeric(results_district_df["Total Students"])

results_district_df.dtypes

Total Schools               int64
Total Students              int64
Total Budget                int64
Average Math Score        float64
Average Reading Score     float64
% Passing Math            float64
% Passing Reading         float64
% Overall Passing Rate    float64
dtype: object

In [209]:
results_district_df["Total Students"] = results_district_df["Total Students"].astype(int).map('{0:,d}'.format)
results_district_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate
0,15,"39,170",24649428,78.985371,81.87784,74.980853,85.805463,80.431606

In [213]:
results_district_df["Total Budget"] = results_district_df["Total Budget"].astype(int).map('${0:,.2f}'.format)
results_district_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate
0,15,"39,170","$24,649,428.00",78.985371,81.87784,74.980853,85.805463,80.431606

In [216]:
school_names = school_data_complete['school_name'].unique()
school_names

array(['Huang High School', 'Figueroa High School', 'Shelton High School',
       'Hernandez High School', 'Griffin High School',
       'Wilson High School', 'Cabrera High School', 'Bailey High School',
       'Holden High School', 'Pena High School', 'Wright High School',
       'Rodriguez High School', 'Johnson High School', 'Ford High School',
       'Thomas High School'], dtype=object)

In [229]:
#school_data_complete_summary = school_data_complete[["school_name",
#                                                     "type",
#                                                     "student_name",
#                                                     "budget",
#                                                     "math_score",
#                                                     "reading_score"]]
#school_data_complete_summary.head()

In [230]:
grouped_school_summary = school_data_complete.groupby(["school_name"])
grouped_school_summary.count().head()

,Student ID,student_name,gender,grade,reading_score,math_score,School ID,type,size,budget
school_name,,,,,,,,,,
Bailey High School,4976,4976,4976,4976,4976,4976,4976,4976,4976,4976
Cabrera High School,1858,1858,1858,1858,1858,1858,1858,1858,1858,1858
Figueroa High School,2949,2949,2949,2949,2949,2949,2949,2949,2949,2949
Ford High School,2739,2739,2739,2739,2739,2739,2739,2739,2739,2739
Griffin High School,1468,1468,1468,1468,1468,1468,1468,1468,1468,1468

In [241]:
total_school_students = grouped_school_summary["student_name"].count()
total_school_students

school_name
Bailey High School       4976
Cabrera High School      1858
Figueroa High School     2949
Ford High School         2739
Griffin High School      1468
Hernandez High School    4635
Holden High School        427
Huang High School        2917
Johnson High School      4761
Pena High School          962
Rodriguez High School    3999
Shelton High School      1761
Thomas High School       1635
Wilson High School       2283
Wright High School       1800
Name: student_name, dtype: int64

In [234]:
# ????????????? not giving correct values
total_school_budget = grouped_school_summary["budget"].sum()
total_school_budget

school_name
Bailey High School       15549641728
Cabrera High School       2009159448
Figueroa High School      5557128039
Ford High School          4831365924
Griffin High School       1346890000
Hernandez High School    14007062700
Holden High School         105933149
Huang High School         5573322295
Johnson High School      14733628650
Pena High School           563595396
Rodriguez High School    10186904637
Shelton High School       1860672600
Thomas High School        1705517550
Wilson High School        3012587442
Wright High School        1888920000
Name: budget, dtype: int64

In [ ]:
per_student_budget = total_school_budget/

In [ ]:
#summary_table = pd.DataFrame({"School Type": [school_names]
#                              "Total Students": 
#                             })